### ФАЙЛ С ГОТОВЫМИ ЗАГОТОВКАМИ ТЕКСТА ДЛЯ ХЕНДЛЕРОВ ###


# ТЕКСТ ДЛЯ КНОПКИ F.A.Q. И КОМАНДЫ /help
text_1 = """тут полезная информация по боту"""

# Текст для кнопки /ask
text_2 = """ ▎Техническая поддержка

Если у вас возникли вопросы или проблемы с работой чат-бота, вы можете обратиться в техническую поддержку.

Как связаться с поддержкой:

1. Напишите ваше сообщение специалисту по адресу support@gmkzoloto.ru.
2. Опишите вашу проблему или вопрос подробно.
3. Отправьте сообщение, и мы постараемся ответить вам как можно скорее.

Мы ценим ваше время и сделаем всё возможное, чтобы помочь вам!"""

# Текст для команды /start после идентификации пользователя в БД
text_3 = """Это корпоративный чат-бот"""

# Текст для вопросно-ответных пар в БД
text_4 = {"А сколько у нас дней отпуска?": "36.",
        "Сколько составляет официальный отпуск?": "36 дней",
        "Какой срок отпуска?": "36 дней",
        "А выходные считаются?": "Считаются. Отпуск считается в календарных днях, а не в рабочих.",
        "Выходные входят в отпуск?":"Да, входят",
        "Отпуск считается по календарным или рабочим дням?":"По календарным.",
        "А можно разбить не на 2 части, а на 3 и больше?": "Можно, но чтобы одна часть была не короче 14 календарных дней.",
        "Можно ли разделить отпуск на большее количество частей?":"Да, но каждая часть должна составлять не менее 14 календарных дней.",
        "Допускается ли деление отпуска на три или более частей? ":"Да, позволительно, но одна из частей должна быть минимум 14 календарных дней.",
        "Как перенести отпуск?":"Заполнить форму, подписать у руководителя и отправить HR'у. Но важно это сделать за 2 недели до предполагаемой даты ранее запланированного периода отпуска.",
        "Как организовать перенос отпуска?":"Заполните форму, получите подпись от руководителя и отправьте её в HR. Это нужно сделать за 2 недели до планируемой даты отпуска.",
        "Как мне изменить свои планы относительно отпуска?":"Для этого нужно заполнить соответствующую форму, получить подпись у начальника и передать HR за 2 недели до предполагаемого отдыха.",
        "Какие плюшки доступны нам?":"Отсрочка и ИТ-ипотека.",
        "Какие дополнительные плюсы доступны нам?":"У нас есть возможность воспользоваться отсрочкой и IT-ипотекой.",
        "Какие преимущества наши сотрудники могут получить?":"Есть варианты, такие как отсрочка и программа IT-ипотеки.",
        "Как получить отсрочку?":"Самостоятельно подать заявление на Госуслугах. Важно: поменяете место работы – отсрочка перестанет действовать.",
        "Как я могу оформить отсрочку?":"Нужно подать заявку самостоятельно через Госуслуги.",
        "Каким образом можно получить отсрочку?":"Для этого следует самостоятельно заполнить заявление на Госуслугах.",
        "Как получить ИТ-ипотеку?":"Для полного ответа перейдите по этой ссылке https://lenta.ru/articles/2024/12/26/kak-poluchit-it-ipoteku-v-rossii/",
        }


